[
  {
    "title": "What is JSON Crack and what does it do?",
    "content": "JSON Crack is a versatile online tool designed to visualize and analyze various data formats, including JSON, YAML, CSV, XML and more. It transforms complex data into intuitive graphs and tree views, making it ideal for developers, data analysts, and anyone working with structured data."
  },
  {
    "title": "Is JSON Crack free?",
    "content": "JSON Crack offers a free forever plan with open-source access. For advanced features and increased usage limits, you can upgrade to a premium plan."
  },
  {
    "title": "Is my data secure?",
    "content": "Absolutely! JSON Crack prioritizes your data privacy. When you paste or import your data into the editor, it's processed only on your browser to create the visualization without going into our servers. Your data remains completely private and is never stored anywhere unless you choose to upload it manually."
  },
  {
    "title": "Can I convert JSON to other formats using JSON Crack?",
    "content": "Yes, JSON Crack offers robust data conversion capabilities. You can easily convert JSON to YAML, XML to JSON, CSV to JSON and other popular formats."
  },
  {
    "title": "Can I edit JSON data directly in graphs?",
    "content": "Yes, as part of the premium plan, you can edit JSON data directly in the editor. This feature allows you to make changes to your data and visualize the results in real-time."
  },
  {
    "title": "What kind of data formats are supported?",
    "content": "A wide range of data formats are supported including JSON, YAML, XML, CSV, and TOML."
  },
  {
    "title": "Can I customize the graph colors?",
    "content": "Yes, you can customize the colors of the graph to match your brand or personal preferences as part of the premium plan."
  },
  {
    "title": "What size of data can I visualize?",
    "content": "You can visualize data up to 300 KB in size with the free plan and up to 4 MB with premium plan. It might vary depending on the complexity of the data and your hardware."
  },
  {
    "title": "Can I export the generated graphs?",
    "content": "Yes, you can export the generated graphs as PNG, JPEG, or SVG files."
  },
  {
    "title": "I purchased a premium plan, how do I access it?",
    "content": "After purchasing a premium plan, you should sign up with the email you used during the purchase or log in with the same email. The premium features will be automatically unlocked for you."
  },
  {
    "title": "How to use VS Code extension?",
    "content": "You can use the VS Code extension to visualize JSON data directly in your editor. Install the extension from the VS Code marketplace and follow the instructions at extension's page."
  }
]
