{
  "Introduction": [
    "Welcome to JSON Crack.",
    "JSON Crack (“us”, “we”, or “our”) operates https://jsoncrack.com (hereinafter referred to as “Service”).",
    "Our Privacy Policy governs your visit to https://jsoncrack.com, explaining how we collect, safeguard, and disclose information resulting from your use of our Service.",
    "By using the Service, you agree to the collection and use of information in accordance with this policy. Unless otherwise defined in this Privacy Policy, the terms used have the same meanings as in our Terms and Conditions.",
    "Our Terms and Conditions (“Terms”) govern all use of our Service and together with the Privacy Policy constitute your agreement with us (“agreement”)."
  ],
  "Definitions": [
    "SERVICE means the https://jsoncrack.com website.",
    "PERSONAL DATA means data about a living individual who can be identified from those data.",
    "USAGE DATA is data collected automatically, generated by the use of Service or from Service infrastructure itself (e.g., the duration of a page visit).",
    "COOKIES are small files stored on your device (computer or mobile device)."
  ],
  "Information Collection and Use": [
    "We collect limited information for the purpose of improving our Service. We do not collect or store any Personal Data beyond what is necessary for analytics and security."
  ],
  "Data Collection": [
    "Usage Data",
    "• We may collect information that your browser sends whenever you visit our Service (“Usage Data”).",
    "• This may include your computer's IP address, browser type, browser version, pages visited, time and date of your visit, time spent on pages, and other diagnostic data.",
    "Cookies",
    "• We use cookies and similar tracking technologies to monitor activity on our Service.",
    "• Cookies are files with a small amount of data that may include an anonymous unique identifier."
  ],
  "Use of Data": [
    "JSON Crack uses collected data to:",
    "• Provide and maintain the Service;",
    "• Improve and analyze Service performance."
  ],
  "Security of Data": [
    "The data you paste into the editor for transformation into visualizations is not stored or processed on our servers, ensuring that your information remains private.",
    "Usage Data may be shared with third-party analytics services as outlined below."
  ],
  "Analytics": [
    "We may use Google Analytics to monitor Service usage.",
    "• Google Analytics collects non-personally identifying information such as browser type, referring pages, and time spent on the site.",
    "• We do not collect IP addresses through Google Analytics.",
    "• Learn more about Google's privacy practices: https://support.google.com/analytics/answer/4597324?hl=en"
  ],
  "Changes to This Privacy Policy": [
    "We may update our Privacy Policy from time to time. We will notify you of any changes by posting the new Privacy Policy on this page.",
    "You are advised to review this Privacy Policy periodically for any changes. Changes are effective when posted on this page."
  ],
  "Contact Us": [
    "If you have any questions about this Privacy Policy, please contact us at contact@todiagram.com."
  ]
}
